package volume01;

public class Chapter_17_annotation {
/*
 * @Override 어노테이션의 용도는 무엇인가요?
메소드가 부모 클래스에 있는 메소드를 Override했다는 것을 명시적으로 선언할 때 @Override 어노테이션을 사용한다. 이 어노테이션을 사용하는 가장 큰 이유는 해당 메소드 선언이 정확히 부모 클래스를 Override했는지를 확인하기 위함이며, 다른 개발자가 해당 코드를 보고 쉽게 이해할 수 있도록 하는 이유도 존재한다.

@SupressWarnings 어노테이션의 용도는 무엇인가요? 
@SupressWarnings 어노테이션은 컴파일시 발생 할 수 있는 경고(warning)을 컴파일러에게 이야기 해 주는 것이다. 따라서, 반드시 사용할 필요는 없다.

@Deprecated 어노테이션의 용도는 무엇인가요? 
더 이상 사용하지 않는 메소드를 선언 앞에 @Deprecated 를 사용한다. 만약 해당 메소드를 다른 메소드에서 참조하면, 경고가 발생한다.

어노테이션을 선언할 때 사용하는 어노테이션을 무엇이라고 부르나요?
어노테이션을 선언할 때 사용하는 어노테이션을 메타 어노테이션(Meta annotation)이라고 부른다. 

4번 문제의 답에 있는 어노테이션들을 사용할 때 import 해야 하는 패키지는 무엇인가요? 
메타 어노테이션을 선언하기 위해서는 java.lang.annotation 패키지에 선언된 메타 어노테이션 관련 클래스들을 import해야만 한다.

@Target 어노테이션의 용도는 무엇인가요? 
@Target 어노테이션은 선언하는 어노테이션의 적용 범위를 정할 때 사용한다.

@Retention 어노테이션의 용도는 무엇인가요? 
@Retention 어노테이션은 어노테이션 정보가 언제까지 유효한지를 선언한다. 컴파일에서 실행시까지 어노테이션이 유효한 정도를 정할 수 있다.

@Inherited 어노테이션의 용도는 무엇인가요?
@Inherited 어노테이션은 모든 자식 클래스에서 부모 클래스의 어노테이션을 사용 가능하다는 것을 선언한다. 

어노테이션을 선언할 때에는 class 대신 어떤 예약어를 사용해야 하나요? 

어노테이션을 선언할 때에는 class라는 예약어 대신 @interface라는 어노테이션을 사용한다. 
 * */
}
